In [26]:
import pandas as pd

In [72]:
df = pd.DataFrame(
    [[1, 'foo'], [2, 'bar'], [3, 'baz']], columns=['value', 'id'])

In [3]:
df.head(2)

   value   id
0      1  foo
1      2  bar

In [4]:
df[df['id'].isin(['foo','bar'])]

   value   id
0      1  foo
1      2  bar

In [5]:
df[(df['id'].isin(['foo','bar'])) & (df['value'].isin([1]))]

   value   id
0      1  foo

In [6]:
df[(df['id'].isin(['foo','bar'])) & (df['value'] >= 1)]

   value   id
0      1  foo
1      2  bar

In [73]:
df[(df['id'].isin(['foo','bar'])) & (df['value'] >= 1)].groupby('id')['value'].sum()

id
bar    2
foo    1
Name: value, dtype: int64

In [29]:
## aggregate different column
df = pd.DataFrame({'team': ['A', 'B', 'B', 'B', 'B', 'M', 'M', 'M'],
                   'position': ['G', 'G', 'F', 'G', 'F', 'F', 'C', 'C'],
                   'assists': [5, 7, 7, 8, 5, 7, 6, 9],
                   'rebounds': [11, 8, 10, 6, 6, 9, 6, 10]})

In [11]:
new = df.groupby(['team', 'position']).agg({'assists': ['mean']}).reset_index()

#rename columns 
new.columns = ['team', 'pos', 'mean_assists']

In [31]:
df[(df['team'].isin(['A','B'])) & (df['position'] == 'G')]

  team position  assists  rebounds
0    A        G        5        11
1    B        G        7         8
3    B        G        8         6

In [37]:
new=df[(df['team'].isin(['A','B'])) & (df['position'] == 'G')].groupby(['team','position']).agg({'assists':['mean','max']}).reset_index()
new.columns = ['team', 'pos', 'mean_assists','max_assists']
new

  team pos  mean_assists  max_assists
0    A   G           5.0            5
1    B   G           7.5            8

In [48]:
#pandas filter and select and order
df[['team','position','assists']][(df['team'].isin(['A','B'])) & (df['position'] == 'G')].sort_values("assists", axis = 0, ascending = False,
                 inplace = False, na_position ='last')

  team position  assists
3    B        G        8
1    B        G        7
0    A        G        5

In [12]:
print(new)

  team pos  mean_assists
0    A   G           5.0
1    B   F           6.0
2    B   G           7.5
3    M   C           7.5
4    M   F           7.0

In [15]:
new= df.groupby(['team', 'position']).agg({'rebounds': ['median', 'max']}).reset_index()
new.columns = ['team', 'pos', 'median_rebounds','max_rebounds']

In [16]:
print(new)

  team pos  median_rebounds  max_rebounds
0    A   G               11            11
1    B   F                8            10
2    B   G                7             8
3    M   C                8            10
4    M   F                9             9

In [17]:
new= df.groupby(['team', 'position']).agg({'rebounds': ['median', 'max'], 'assists': ['mean','median']}).reset_index()

In [18]:
print(new)

  team position rebounds     assists
                  median max    mean median
0    A        G       11  11     5.0    5.0
1    B        F        8  10     6.0    6.0
2    B        G        7   8     7.5    7.5
3    M        C        8  10     7.5    7.5
4    M        F        9   9     7.0    7.0

In [19]:
times = ['2020-01-01', '2020-01-03', '2020-01-04', '2020-01-05', '2020-01-29']
s = pd.Series(range(5), index=pd.DatetimeIndex(times))

In [21]:
s

2020-01-01    0
2020-01-03    1
2020-01-04    2
2020-01-05    3
2020-01-29    4
dtype: int64

In [20]:
s.rolling(window=2).sum()

2020-01-01    NaN
2020-01-03    1.0
2020-01-04    3.0
2020-01-05    5.0
2020-01-29    7.0
dtype: float64

In [22]:
df = pd.DataFrame(
    {"x": 1},
    index=[
        pd.Timestamp("20130101 09:00:01"),
        pd.Timestamp("20130101 09:00:02"),
        pd.Timestamp("20130101 09:00:03"),
        pd.Timestamp("20130101 09:00:04"),
        pd.Timestamp("20130101 09:00:06"),
    ],
)

In [27]:
df["right"] = df.rolling("2s", closed="right").x.sum()  # default
print(df)

                     x  right
2013-01-01 09:00:01  1    1.0
2013-01-01 09:00:02  1    2.0
2013-01-01 09:00:03  1    2.0
2013-01-01 09:00:04  1    2.0
2013-01-01 09:00:06  1    1.0

In [28]:
df["left"] = df.rolling("2s", closed="left").x.sum()  # default
print(df)

                     x  right  left
2013-01-01 09:00:01  1    1.0   NaN
2013-01-01 09:00:02  1    2.0   1.0
2013-01-01 09:00:03  1    2.0   2.0
2013-01-01 09:00:04  1    2.0   2.0
2013-01-01 09:00:06  1    1.0   1.0

In [29]:
df = pd.DataFrame(
    {"A": [0, 1, 2, 3, 4]}, index=pd.date_range("2020", periods=5, freq="1D")
)

In [30]:
print(df)

            A
2020-01-01  0
2020-01-02  1
2020-01-03  2
2020-01-04  3
2020-01-05  4

In [37]:
df.rolling("2D").mean()

              A
2020-01-01  0.0
2020-01-02  0.5
2020-01-03  1.5
2020-01-04  2.5
2020-01-05  3.5

In [38]:
df.rolling("2D").mean()

              A
2020-01-01  0.0
2020-01-02  0.5
2020-01-03  1.5
2020-01-04  2.5
2020-01-05  3.5

In [39]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [40]:
df.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [6]:
df = pd.DataFrame({'foo': ['A', 'A', 'A', 'B', 'B', 'B', 'C', 'C', 'C'],
                   'bar': [1, 1, 1, 2, 2, 2, 3, 3, 3],
                   'baz': [11, 12, 13, 14, 15, 16, 17, 18, 19]},
                  index = [14, 15, 16, 17, 18, 19, 20, 21, 22])

In [7]:
df

   foo  bar  baz
14   A    1   11
15   A    1   12
16   A    1   13
17   B    2   14
18   B    2   15
19   B    2   16
20   C    3   17
21   C    3   18
22   C    3   19

In [4]:
df.reset_index(inplace=True)    # This gives us index 0,1,2... and a new col 'index'
df.set_index('baz', inplace=True)    # Replace with date in yours
# This next bit does the groupby and rolling, which will give a df 
# with a multi index of foo and baz, then reset_index(0) to remove the foo index level
# so that it matches the original df index so that you can add it as a new column
df['roll'] = df.groupby('foo')['bar'].rolling(3).sum().reset_index(0,drop=True)
df.reset_index(inplace=True)    # brings baz back into the df as a column
df.set_index('index', inplace=True)   # sets the index back to the original

In [5]:
df = df.drop('column_name', 1) ##drop column

       baz foo  bar  roll
index
14      11   A    1   NaN
15      12   A    1   NaN
16      13   A    1   3.0
17      14   B    2   NaN
18      15   B    2   NaN
19      16   B    2   6.0
20      17   C    3   NaN
21      18   C    3   NaN
22      19   C    3   9.0

In [8]:
import pandas as pd
  
# Initializing the nested list with Data set
age_list = [['Afghanistan', 1952, 8425333, 'Asia'],
            ['Australia', 1957, 9712569, 'Oceania'],
            ['Brazil', 1962, 76039390, 'Americas'],
            ['China', 1957, 637408000, 'Asia'],
            ['France', 1957, 44310863, 'Europe'],
            ['India', 1952, 3.72e+08, 'Asia'],
            ['United States', 1957, 171984000, 'Americas']]
  
# creating a pandas dataframe
df = pd.DataFrame(age_list, columns=['Country', 'Year',
                                     'Population', 'Continent'])
  
# Sorting by column "Population"
df.sort_values(by=['Population'], ascending=False)

         Country  Year   Population Continent
3          China  1957  637408000.0      Asia
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
2         Brazil  1962   76039390.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia

In [9]:
import pandas as pd
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
def addOne(v):
        v += 1
        return v

In [11]:
df['A'] = df['A'].map(addOne) ## APPLY TO ONE COLUMN

In [16]:
import pandas as pd 
age_list = [['Afghanistan', 1952, 8425333, 'Asia'],
            ['Australia', 1957, 9712569, 'Oceania'],
            ['Brazil', 1962, 76039390, 'Americas'],
            ['China', 1957, 637408000, 'Asia'],
            ['France', 1957, 44310863, 'Europe'],
            ['India', 1952, 3.72e+08, 'Asia'],
            ['United States', 1957, 171984000, 'Americas']]
age_list

# creating a pandas dataframe
df = pd.DataFrame(age_list, columns=['Country', 'Year',
                                     'Population', 'Continent'])

In [17]:
df['Country']

0      Afghanistan
1        Australia
2           Brazil
3            China
4           France
5            India
6    United States
Name: Country, dtype: object

In [19]:
def Arab_League (row):
   if   row['Country'] == 'Algeria' :
       return 'Arab_League_MEMBER'       
   elif row['Country'] == 'Bahrain' :
       return 'Arab_League_MEMBER'        
   elif row['Country'] == 'Comoros' :
       return 'Arab_League_MEMBER'       
   elif row['Country'] == 'Djibouti' :
       return 'Arab_League_MEMBER'             
   elif row['Country'] == 'Egypt' :
       return 'Arab_League_MEMBER'        
   elif row['Country'] == 'Iraq' :
       return 'Arab_League_MEMBER'    
   elif row['Country'] == 'Jordan' :
       return 'Arab_League_MEMBER'      
   elif row['Country'] == 'Kuwait' :
       return 'Arab_League_MEMBER'          
   elif row['Country'] == 'Lebanon' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Libya' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Mauritania' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Morocoo' :
       return 'Arab_League_MEMBER'	   
   elif row['Country'] == 'Oman' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'West Bank and Gaza' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Qatar' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Saudi Arabia' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Somalia' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Sudan' :
       return 'Arab_League_MEMBER'
   elif row['Country'] == 'Syria' :
       return 'Arab_League_MEMBER'	   
   elif row['Country'] == 'Tunisia' :
       return 'Arab_League_MEMBER'	   	 
   elif row['Country'] == 'United Arab Emirates' :
       return 'Arab_League_MEMBER'	   	 
   elif row['Country'] == 'Yemen' :
       return 'Arab_League_MEMBER'	   
   elif row['Country'] == 'Eritrea' :
       return 'Arab_League_MEMBER'	
   else :
      return 'Not_In_Arab_League'  
##
      
df['Arab_League'] = df.apply (lambda row: Arab_League (row),axis=1)  

df['Arab_League'].value_counts(sort=False, dropna=False)

Not_In_Arab_League    7
Name: Arab_League, dtype: int64

In [20]:
## lets check NATO membership on abovr dataset using a dictionary

NATO = {'Albania':'NATO','Belgium':'NATO','Bulgaria':'NATO','Canada':'NATO','Croatia':'NATO','Czech Republic':'NATO','Denmark':'NATO','Estonia':'NATO','France':'NATO','Germany':'NATO','Greece':'NATO','Hungary':'NATO','Iceland':'NATO','Italy':'NATO','Latvia':'NATO','Lithuania':'NATO','Luxembourg':'NATO','Netherlands':'NATO','Norway':'NATO','Poland':'NATO','Portugal':'NATO','Romania':'NATO','Slovak Republic':'NATO','Slovenia':'NATO','Spain':'NATO','Turkey':'NATO','United Kingdom':'NATO','United States':'NATO'}

In [32]:
#df.drop('NATO',axis=1)

df['NATO']=df['Country'].map(NATO)
#

In [33]:
df

         Country  Year   Population Continent         Arab_League  NATO
0    Afghanistan  1952    8425333.0      Asia  Not_In_Arab_League   NaN
1      Australia  1957    9712569.0   Oceania  Not_In_Arab_League   NaN
2         Brazil  1962   76039390.0  Americas  Not_In_Arab_League   NaN
3          China  1957  637408000.0      Asia  Not_In_Arab_League   NaN
4         France  1957   44310863.0    Europe  Not_In_Arab_League  NATO
5          India  1952  372000000.0      Asia  Not_In_Arab_League   NaN
6  United States  1957  171984000.0  Americas  Not_In_Arab_League  NATO

In [46]:
df['NATO']=df['NATO'].fillna('Not in NATO')

In [40]:
## probably not wise with big lists
G7 = ['Italy','United States','UK','France','Germany','Japan','Canada'] 
  
# printing original list
print("The original list is : " + str(G7))
  
# initializing K 
K = "G7"
  
# using dictionary comprehension
# + operator used to concat default key and values 
res = {str(ele) : K for ele in G7 }
  
# printing result 
print("The constructed Dictionary : " + str(res))

The original list is : ['Italy', 'United States', 'UK', 'France', 'Germany', 'Japan', 'Canada']
The constructed Dictionary : {'Italy': 'G7', 'United States': 'G7', 'UK': 'G7', 'France': 'G7', 'Germany': 'G7', 'Japan': 'G7', 'Canada': 'G7'}

In [41]:
df['G7']=df['Country'].map(res)

In [42]:
res

{'Italy': 'G7',
 'United States': 'G7',
 'UK': 'G7',
 'France': 'G7',
 'Germany': 'G7',
 'Japan': 'G7',
 'Canada': 'G7'}

In [47]:
df

,Country,Year,Population,Continent,Arab_League,NATO,G7
0,Afghanistan,1952,8425333.0,Asia,Not_In_Arab_League,Not in NATO,Not in G7
1,Australia,1957,9712569.0,Oceania,Not_In_Arab_League,Not in NATO,Not in G7
2,Brazil,1962,76039390.0,Americas,Not_In_Arab_League,Not in NATO,Not in G7
3,China,1957,637408000.0,Asia,Not_In_Arab_League,Not in NATO,Not in G7
4,France,1957,44310863.0,Europe,Not_In_Arab_League,NATO,G7
5,India,1952,372000000.0,Asia,Not_In_Arab_League,Not in NATO,Not in G7
6,United States,1957,171984000.0,Americas,Not_In_Arab_League,NATO,G7

In [44]:
##clean up
df['G7']=df['G7'].fillna('Not in G7')

In [48]:
##Pandas lag, shift create lag values function

df = pd.DataFrame({
    "date": pd.date_range("2020-01-01", freq='D', periods=5),
    "sales": [22, 30, 32, 25, 42]
})

In [52]:
df

        date  sales  diff
0 2020-01-01     22  -8.0
1 2020-01-02     30  -2.0
2 2020-01-03     32   7.0
3 2020-01-04     25 -17.0
4 2020-01-05     42   NaN

In [55]:
df['lag'] =  df.shift(1)['sales']

In [57]:
df['diff']= df['sales']-df.shift(1)['sales']

In [58]:
## we get 1 dat lag value
df

        date  sales  diff   lag
0 2020-01-01     22   NaN   NaN
1 2020-01-02     30   8.0  22.0
2 2020-01-03     32   2.0  30.0
3 2020-01-04     25  -7.0  32.0
4 2020-01-05     42  17.0  25.0

In [59]:
df['diff_pct']= (df['sales']-df.shift(1)['sales'])/df['sales']

In [60]:
df

        date  sales  diff   lag  diff_pct
0 2020-01-01     22   NaN   NaN       NaN
1 2020-01-02     30   8.0  22.0  0.266667
2 2020-01-03     32   2.0  30.0  0.062500
3 2020-01-04     25  -7.0  32.0 -0.280000
4 2020-01-05     42  17.0  25.0  0.404762

In [62]:
df['3_day_momentum']=(df['diff_pct']+df.shift(1)['diff_pct']+df.shift(2)['diff_pct'])/3 ## and so on
df

        date  sales  diff   lag  diff_pct  3_day_momentum
0 2020-01-01     22   NaN   NaN       NaN             NaN
1 2020-01-02     30   8.0  22.0  0.266667             NaN
2 2020-01-03     32   2.0  30.0  0.062500             NaN
3 2020-01-04     25  -7.0  32.0 -0.280000        0.016389
4 2020-01-05     42  17.0  25.0  0.404762        0.062421

In [63]:
#processin dates using pandas
df.reset_index(inplace=True)
df['year'] = df.date.dt.year

In [64]:
df['month'] = df.date.dt.month
df['day'] = df.date.dt.day
df['day of week'] = df.date.dt.dayofweek

In [66]:
df.head(10)

,index,date,sales,diff,lag,diff_pct,3_day_momentum,year,month,day,day of week
0,0,2020-01-01,22,NaN,NaN,NaN,NaN,2020,1,1,2
1,1,2020-01-02,30,8.0,22.0,0.266667,NaN,2020,1,2,3
2,2,2020-01-03,32,2.0,30.0,0.062500,NaN,2020,1,3,4
3,3,2020-01-04,25,-7.0,32.0,-0.280000,0.016389,2020,1,4,5
4,4,2020-01-05,42,17.0,25.0,0.404762,0.062421,2020,1,5,6

In [68]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.quarter.html
#add a few more
df['Quarter'] = df.date.dt.quarter
df.head(10)

,index,date,sales,diff,lag,diff_pct,3_day_momentum,year,month,day,day of week,Quarter
0,0,2020-01-01,22,NaN,NaN,NaN,NaN,2020,1,1,2,1
1,1,2020-01-02,30,8.0,22.0,0.266667,NaN,2020,1,2,3,1
2,2,2020-01-03,32,2.0,30.0,0.062500,NaN,2020,1,3,4,1
3,3,2020-01-04,25,-7.0,32.0,-0.280000,0.016389,2020,1,4,5,1
4,4,2020-01-05,42,17.0,25.0,0.404762,0.062421,2020,1,5,6,1

In [70]:
##function lag
## custom lag 
## WeekOfMonth
## Pandas version
print(pd.__version__)
#df['WeekOfMonth'] = df.date.dt.WeekOfMonth
##make sure 1.33 or higher for this
df.head(10)

1.1.4

,index,date,sales,diff,lag,diff_pct,3_day_momentum,year,month,day,day of week,Quarter
0,0,2020-01-01,22,NaN,NaN,NaN,NaN,2020,1,1,2,1
1,1,2020-01-02,30,8.0,22.0,0.266667,NaN,2020,1,2,3,1
2,2,2020-01-03,32,2.0,30.0,0.062500,NaN,2020,1,3,4,1
3,3,2020-01-04,25,-7.0,32.0,-0.280000,0.016389,2020,1,4,5,1
4,4,2020-01-05,42,17.0,25.0,0.404762,0.062421,2020,1,5,6,1

In [71]:
def weekinmonth(dates):
    """Get week number in a month.
    
    Parameters: 
        dates (pd.Series): Series of dates.
    Returns: 
        pd.Series: Week number in a month.
    """
    ##i should not do this  and i should for speed
    firstday_in_month = dates - pd.to_timedelta(dates.dt.day - 1, unit='d')
    return (dates.dt.day-1 + firstday_in_month.dt.weekday) // 7 + 1

In [79]:
##returns a series not a value see above apply returns a value

df['weekinmonth']=weekinmonth(df['date'])

In [49]:
##pandas convert string to dates

values = {'dates':  ['20210305','20210316','20210328'],
          'status': ['Opened','Opened','Closed']
          }

df = pd.DataFrame(values)

print (df)
print (df.dtypes)

      dates  status
0  20210305  Opened
1  20210316  Opened
2  20210328  Closed
dates     object
status    object
dtype: object

In [50]:
##format='%d%b%Y'  would be Month short

df = pd.DataFrame(values)

df['dates'] = pd.to_datetime(df['dates'], format='%Y%m%d')

print (df)
print (df.dtypes)

       dates  status
0 2021-03-05  Opened
1 2021-03-16  Opened
2 2021-03-28  Closed
dates     datetime64[ns]
status            object
dtype: object

In [75]:
df = pd.read_csv('C:\\Users\\Admin\\Downloads\\archive\\world-happiness-report-2019.csv')

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country (region)         156 non-null    object
 1   Ladder                   156 non-null    int64
 2   SD of Ladder             156 non-null    int64
 3   Positive affect          155 non-null    float64
 4   Negative affect          155 non-null    float64
 5   Social support           155 non-null    float64
 6   Freedom                  155 non-null    float64
 7   Corruption               148 non-null    float64
 8   Generosity               155 non-null    float64
 9   Log of GDP
per capita    152 non-null    float64
 10  Healthy life
expectancy  150 non-null    float64
 11  first_five_Letter        0 non-null      object
 12  starts_with_F_f          156 non-null    bool
dtypes: bool(1), float64(8), int64(2), object(2)
memory usage: 14.9+ KB

In [84]:
import numpy as np
import re
#(pat = '([A-Z]i.)')
df['first_five_Letter']=df['Country (region)'].str.extract(pat='(^.{5})')
df.head()

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy,first_five_Letter,starts_with_F_f
0,Finland,1,4,41.0,10.0,2.0,5.0,4.0,47.0,22.0,27.0,Finla,True
1,Denmark,2,13,24.0,26.0,4.0,6.0,3.0,22.0,14.0,23.0,Denma,False
2,Norway,3,8,16.0,29.0,3.0,3.0,8.0,11.0,7.0,12.0,Norwa,False
3,Iceland,4,9,3.0,3.0,1.0,7.0,45.0,3.0,15.0,13.0,Icela,False
4,Netherlands,5,1,12.0,25.0,15.0,19.0,12.0,7.0,12.0,18.0,Nethe,False

In [96]:
# ^.*(.{5})
df['last_five_Letter']=df['Country (region)'].str.extract(pat='(^.*(.{5}))')[1]

In [97]:
df.head()

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy,first_five_Letter,starts_with_F_f,last_five_Letter
0,Finland,1,4,41.0,10.0,2.0,5.0,4.0,47.0,22.0,27.0,Finla,True,nland
1,Denmark,2,13,24.0,26.0,4.0,6.0,3.0,22.0,14.0,23.0,Denma,False,nmark
2,Norway,3,8,16.0,29.0,3.0,3.0,8.0,11.0,7.0,12.0,Norwa,False,orway
3,Iceland,4,9,3.0,3.0,1.0,7.0,45.0,3.0,15.0,13.0,Icela,False,eland
4,Netherlands,5,1,12.0,25.0,15.0,19.0,12.0,7.0,12.0,18.0,Nethe,False,lands

In [98]:
df['starts_with_F_f']=df['Country (region)'].str.count(r'(^[Ff]i.*)')==1

In [146]:
##code|program you can search for NATO this way
df['france finland']=df['Country (region)'].str.count(pat='(France|Finland)')>0

In [194]:
##/a{2,}/
df[df['Country (region)'].str.contains(pat='(nz)|(^li)',case=False)] ##c

C:\Users\Admin\anaconda3\envs\pandas_playground\lib\site-packages\pandas\core\strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy,first_five_Letter,starts_with_F_f,last_five_Letter,containsthreeas,france finland
41,Lithuania,42,55,138.0,41.0,17.0,122.0,113.0,124.0,36.0,62.0,Lithu,False,uania,False,False
71,Libya,72,115,85.0,137.0,73.0,79.0,31.0,87.0,63.0,96.0,Libya,False,Libya,False,False
140,Liberia,141,156,103.0,146.0,127.0,94.0,126.0,110.0,150.0,126.0,Liber,False,beria,False,False
152,Tanzania,153,122,78.0,50.0,131.0,78.0,34.0,49.0,125.0,118.0,Tanza,False,zania,False,False

In [223]:
##?<=new
cnt=df[['Country (region)']][df['Country (region)'].str.contains(pat='(land$)',case=False)].count()[0]
print(type(cnt)) ## without [0] its a series
print(cnt)

<class 'numpy.int64'>
8

C:\Users\Admin\anaconda3\envs\pandas_playground\lib\site-packages\pandas\core\strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

In [226]:
## recursion in pandas dataframe
import datetime
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

data = {
        'ID': [1,2,3,4,5,6,7,8],
        'Name': ['Keith','Josh','Robin','Raja','Tridip','Arijit','Amit','Dev'],
        'MgrID': [0,1,1,2,0,5,5,6]
    }

df = pd.DataFrame.from_dict(data)
df.set_index('ID', inplace=True, drop=False, append=False)

In [227]:
df.head()

    ID    Name  MgrID
ID
1    1   Keith      0
2    2    Josh      1
3    3   Robin      1
4    4    Raja      2
5    5  Tridip      0

In [337]:
def nlevel(id, mgr_dict=df.MgrID, _cache={0:0}):
    if id in _cache:
        return _cache[id]

    return 1+nlevel(mgr_dict[id],mgr_dict)

df['nLevel'] = df.ID.map(nlevel)

df[['nLevel','ID','Name']]

    nLevel  ID    Name
ID
1        1   1   Keith
2        2   2    Josh
3        2   3   Robin
4        3   4    Raja
5        1   5  Tridip
6        2   6  Arijit
7        2   7    Amit
8        3   8     Dev

In [346]:
team='A'
mgr_dictteam=dfteam[dfteam['team']==team].MgrID

In [347]:
mgr_dictteam

0    0
2    1
4    0
6    5
Name: MgrID, dtype: int64

In [324]:
type(mgr_dictteam)

pandas.core.series.Series

In [331]:
#
id=1
x=int(mgr_dictteam.where(mgr_dictteam==1).dropna())
type(x)
#s.where(s > 0)

int

In [332]:
print(x)

1

In [286]:
_cacheteam={0:0}
id=1
team='A'
if id in _cacheteam:
        print(_cacheteam[id])
else:
        print("foo")
        mgr_dictteam=dfteam[dfteam['team']==team].MgrID
        1+nlevel(mgr_dictteam[id],mgr_dictteam)

foo

In [287]:
mgr_dictteam

0    0
2    1
4    0
6    5
Name: MgrID, dtype: int64

In [257]:
datateam = {
        'ID': [1,2,3,4,5,6,7,8],
        'team':['A','B','A','B','A','B','A','B'],
        'Name': ['Keith','Josh','Robin','Raja','Tridip','Arijit','Amit','Dev'],
        'MgrID': [0,1,1,2,0,5,5,6]
    }
dfteam = pd.DataFrame.from_dict(datateam)

In [406]:

def nlevelteam(id, mgr_dictteam=dfteam.MgrID, _cache={0:0}):
    if id in _cache:
        return _cache[id]

    return 1+nlevelteam(mgr_dictteam[id],mgr_dictteam)

In [391]:
def level_by_team(team):
    dfteamf=dfteam[dfteam['team']==team]
    ##change tonlevelteam
    dfteamf['nLevel'] = dfteamf.ID.map(nlevelteam)
    return dfteamf

In [407]:
nlevel(3)

2

In [378]:
 import random
 c = random.randint(1,10)

In [379]:
c

3

In [381]:
a = range(4)

In [385]:
for val in a[:-1]:
    print(val)

0
1
2

In [382]:
a

range(0, 4)

In [388]:
[5]

[5]

In [386]:

df = pd.DataFrame({'X': a})
df['Y'] = [5] + [val + 8 for val in a[:-1]]
df

   X   Y
0  0   5
1  1   8
2  2   9
3  3  10

In [390]:
level_by_team('B')
dfteam.ID.map(nlevel)
#team='A'
#dfteamf=dfteam[dfteam['team']==team]
#dfteam[dfteam['team']==team]

C:\Users\Admin\anaconda3\envs\pandas_playground\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

0    1
1    2
2    2
3    3
4    1
5    2
6    2
7    3
Name: ID, dtype: int64

In [247]:


dfteam[['nLevel','team','ID','Name','MgrID']]

   nLevel team  ID    Name  MgrID
0       0    A   1   Keith      0
1       1    B   2    Josh      1
2       2    A   3   Robin      1
3       2    B   4    Raja      2
4       3    A   5  Tridip      0
5       1    B   6  Arijit      5
6       2    A   7    Amit      5
7       2    B   8     Dev      6

In [249]:
dfteam

      ID    Name  MgrID  nLevel
team
A      1   Keith      0       0
B      2    Josh      1       1
A      3   Robin      1       2
B      4    Raja      2       2
A      5  Tridip      0       3
B      6  Arijit      5       1
A      7    Amit      5       2
B      8     Dev      6       2

In [99]:
df[(df['Country (region)'].isin(['France','Finland']))]

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy,first_five_Letter,starts_with_F_f,last_five_Letter
0,Finland,1,4,41.0,10.0,2.0,5.0,4.0,47.0,22.0,27.0,Finla,True,nland
23,France,24,19,56.0,66.0,32.0,69.0,21.0,68.0,25.0,5.0,Franc,False,rance

In [125]:
df['containsthreeas']=df['Country (region)'].str.count('.[Aa]')>3

In [ ]:
##code|program

In [129]:
df[(df['Country (region)'].isin(['Saudi Arabia','Finland','Ireland','Denmark']))]

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy,first_five_Letter,starts_with_F_f,last_five_Letter,containsthreeas
0,Finland,1,4,41.0,10.0,2.0,5.0,4.0,47.0,22.0,27.0,Finla,True,nland,False
1,Denmark,2,13,24.0,26.0,4.0,6.0,3.0,22.0,14.0,23.0,Denma,False,nmark,False
15,Ireland,16,34,33.0,32.0,6.0,33.0,10.0,9.0,6.0,20.0,Irela,False,eland,False
27,Saudi Arabia,28,93,49.0,82.0,62.0,68.0,NaN,82.0,11.0,74.0,Saudi,False,rabia,True

In [126]:
df.head()

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy,first_five_Letter,starts_with_F_f,last_five_Letter,containsthreeas
0,Finland,1,4,41.0,10.0,2.0,5.0,4.0,47.0,22.0,27.0,Finla,True,nland,False
1,Denmark,2,13,24.0,26.0,4.0,6.0,3.0,22.0,14.0,23.0,Denma,False,nmark,False
2,Norway,3,8,16.0,29.0,3.0,3.0,8.0,11.0,7.0,12.0,Norwa,False,orway,False
3,Iceland,4,9,3.0,3.0,1.0,7.0,45.0,3.0,15.0,13.0,Icela,False,eland,False
4,Netherlands,5,1,12.0,25.0,15.0,19.0,12.0,7.0,12.0,18.0,Nethe,False,lands,False

In [412]:
df = pd.DataFrame([[1, 2], [1, 3], [5, 6]], columns=['A', 'B'])
g = df.groupby('A')  #  GROUP BY A
g.filter(lambda x: len(x) > 1)  #  HAVING COUNT(*) > 1 or chain them all together
g.filter(lambda x: len(x) > 1).count() # HAVING COUNT(*) > 1 or chain them all together how many 2

A    2
B    2
dtype: int64

In [135]:
##using siuba
from siuba import _, group_by, summarize
from siuba.data import mtcars

In [136]:
(mtcars
  >> group_by(_.cyl)
  >> summarize(avg_hp = _.hp.mean())
  )

   cyl      avg_hp
0    4   82.636364
1    6  122.285714
2    8  209.214286

In [133]:
from siuba import select,filter

In [134]:
mtcars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 2.9 KB

In [132]:
mtcars.head(10)

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5  18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6  14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7  24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8  22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9  19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4

In [130]:
from siuba import mutate

In [131]:
(mtcars 
        >> filter(_.cyl<=6) >> filter(_.cyl>=4)  
         >> select(_, "mpg","cyl","disp")
  )

     mpg  cyl   disp
0   21.0    6  160.0
1   21.0    6  160.0
2   22.8    4  108.0
3   21.4    6  258.0
5   18.1    6  225.0
7   24.4    4  146.7
8   22.8    4  140.8
9   19.2    6  167.6
10  17.8    6  167.6
17  32.4    4   78.7
18  30.4    4   75.7
19  33.9    4   71.1
20  21.5    4  120.1
25  27.3    4   79.0
26  26.0    4  120.3
27  30.4    4   95.1
29  19.7    6  145.0
31  21.4    4  121.0

In [139]:
mtcars[_.cyl == 4]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [418]:
## create rows between dates with no values and fill with missing values
## for intermittant create continuous

import datetime
 
TODAY = datetime.date.today()
ONE_WEEK = datetime.timedelta(days=7)
ONE_DAY = datetime.timedelta(days=1)
 
df = pd.DataFrame({'dt': [TODAY-ONE_WEEK, TODAY-3*ONE_DAY, TODAY], 'x': [42, 45,127]})

In [419]:
df

           dt    x
0  2021-10-01   42
1  2021-10-05   45
2  2021-10-08  127

In [420]:
##create rows for missing value
r = pd.date_range(start=df.dt.min(), end=df.dt.max())
df=df.set_index('dt').reindex(r).fillna(method='ffill').rename_axis('dt').reset_index()
df

          dt      x
0 2021-10-01   42.0
1 2021-10-02   42.0
2 2021-10-03   42.0
3 2021-10-04   42.0
4 2021-10-05   45.0
5 2021-10-06   45.0
6 2021-10-07   45.0
7 2021-10-08  127.0